amestergram/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)    # 実装は終わっていないことに注意!
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "unko@shoujic.om"], ["password_digest", "$2a$10$YGlN4ldSjPPXoVFZ9Wq5neCtQ3bmP2Oma85dxRozDlbnZj34VO8sC"], ["updated_at", 2016-08-08 06:18:33 UTC], ["id", 6]]